title: PowerShell Encoded Command Execution
id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
status: test
description: Detects execution of PowerShell with the -EncodedCommand parameter,
    commonly used to obfuscate malicious scripts.
references:
    - https://attack.mitre.org/techniques/T1027/010/
    - https://attack.mitre.org/techniques/T1059/001/
author: Florian Roth (Nextron Systems)
date: 2017-03-05
modified: 2023-12-15
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense_evasion
    - attack.t1027.010
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
    selection_cli:
        CommandLine|contains:
            - ' -EncodedCommand '
            - ' -EncodedC '
            - ' -encodedc '
            - ' -ec '
    condition: all of selection_*
falsepositives:
    - Legitimate software using encoded commands for automation
    - System management tools
level: medium
