title: Suspicious MSHTA Process Patterns
id: e32f92d1-523e-49c3-9374-bdb13b46a3ba
status: test
description: Detects suspicious MSHTA execution patterns often used for payload
    delivery and living-off-the-land binary abuse.
references:
    - https://attack.mitre.org/techniques/T1218/005/
    - https://lolbas-project.github.io/lolbas/Binaries/Mshta/
author: Florian Roth (Nextron Systems)
date: 2019-05-12
modified: 2023-10-01
tags:
    - attack.defense_evasion
    - attack.t1218.005
    - attack.execution
    - attack.t1059.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\mshta.exe'
    filter_legit:
        CommandLine|contains:
            - '.hta'
    selection_suspicious:
        CommandLine|contains:
            - 'http://'
            - 'https://'
            - 'javascript:'
            - 'vbscript:'
    condition: selection and (selection_suspicious or not filter_legit)
falsepositives:
    - Legitimate HTA applications used for internal tooling
level: high
